Revit 2027 API
ParameterTypeId.StairsRunActualNumberOfTreads Property
 "Actual Number of Treads": Actual Number of Treads
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunActualNumberOfTreads { get; }
Public Shared ReadOnly Property StairsRunActualNumberOfTreads As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunActualNumberOfTreads {
	ForgeTypeId^ get ();
}
static member StairsRunActualNumberOfTreads : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace